export const statusOption = [
  "นำเสนอโครงการ",
  "ตอบรับเข้าร่วมโครงการ",
  "สำรวจ ออกแบบ และประมาณการ",
  "ประเมินโครงการ พร้อมจัดทำข้อเสนอ",
  "นำเสนอข้อเสนอโครงการ",
  "ลงนามสัญญาให้บริการ",
];
export const activityOption = [
  "ส่งหนังสือเชิญ",
  "ส่งหนังสือเชิญแล้ว-อีเมลล์",
  "ส่งหนังสือเชิญแล้ว-ไปรษณีย์",
  "ส่งหนังสือเชิญแล้ว-ไลน์",
  "ติดตามหนังสือเชิญ",
  "ตอบรับส่งผ่านลิงค์ PEA",
  "ตอบรับส่งทางไปรษณีย์",
  "นัดหมายเพื่อนำเสนอโครงการ",
  "นัดหมายเพื่อสำรวจ",
  "นัดหมายเพื่อนำเสนอโครงการ+สำรวจ",
  "จัดเตรียมข้อเสนอโครงการ+ร่างสัญญา",
  "พิจารณาข้อเสนอโครงการ+ร่างสัญญา",
  "ไม่เข้าร่วมโครงการ",
  "ติดตามเอกสารที่เกี่ยวข้อง",
  "นัดหมายเซ็นต์สัญญา",
];
export const coopLevel = [
  {
    value: 5,
    label: "ให้ความร่วมมือเต็มที่ ตั้งใจฟัง สนใจรายละเอียด เสนอความช่วยเหลือ",
  },
  {
    value: 4,
    label: "ให้ความร่วมมือดี พูดคุยแบบเป็นมิตร ตั้งใจฟังแต่ไม่แสดงความเห็นมาก",
  },
  {
    value: 3,
    label: "รับฟังอย่างสุภาพ ไม่มีท่าทีต่อต้านแต่ไม่แสดงการสนับสนุน",
  },
  {
    value: 2,
    label: "ไม่ค่อยให้ความร่วมมือ ฟังผ่าน ๆ หรือหลีกเลี่ยงการพูดคุย",
  },
  {
    value: 1,
    label: "ปฏิเสธหรือมีท่าทีต่อต้าน ไม่ให้ความร่วมมือเลย",
  },
];
export const understandLevel = [
  {
    value: 5,
    label: "เข้าใจโมเดลชัดเจน อธิบายต่อได้เอง และยอมรับหลักการทั้งหมด",
  },
  {
    value: 4,
    label: "เข้าใจโดยรวม แต่ยังมีข้อสงสัยเพียงเล็กน้อย",
  },
  {
    value: 3,
    label: "เข้าใจบางส่วน แต่ยังมีความเข้าใจผิด/ข้อกังวล",
  },
  {
    value: 2,
    label: "ฟังแล้วไม่ค่อยเข้าใจ ต้องอธิบายหลายครั้ง",
  },
  {
    value: 1,
    label: "ปฏิเสธโมเดลหรือแสดงความไม่เข้าใจ/ไม่ยอมรับชัดเจน",
  },
];
export const decideLevel = [
  {
    value: 5,
    label:
      "ผอ.หรือทีมที่เข้าร่วมมีอำนาจตัดสินใจมีแนวโน้มคณะกรรมการสนับสนุนเต็มที่",
  },
  {
    value: 4,
    label: "ผอ. สามารถเสนอเรื่องต่อ คณะกรรมการมีแนวโน้มสนับสนุนกลางๆ",
  },
  {
    value: 3,
    label: "ต้องขออนุมัติจาก สพฐ./เขต/คณะกรรมการฯ แต่มีแนวโน้มไปต่อได้",
  },
  {
    value: 2,
    label: "อำนาจตัดสินใจซับซ้อน ต้องรอหลายขั้นตอน หรือไม่ชัดเจน ค่อนข้างยาก",
  },
  {
    value: 1,
    label: "ไม่มีอำนาจตัดสินใจเลย หรือมีข้อจำกัดด้านนโยบายชัดเจน",
  },
];
export const readyLevel = [
  {
    value: 5,
    label: "มีข้อมูลครบ ตอบได้ทันที หรือนัดส่งเอกสารชัดเจน",
  },
  {
    value: 4,
    label: "มีข้อมูลส่วนใหญ่ ตอบได้บางส่วน ยินดีส่งเพิ่มเติม",
  },
  {
    value: 3,
    label: "มีข้อมูลจำกัด ต้องกลับไปเช็กหลายอย่าง",
  },
  {
    value: 2,
    label: "ไม่สามารถให้ข้อมูลได้ ต้องประสานงานหลายฝ่าย",
  },
  {
    value: 1,
    label: "ปฏิเสธการให้ข้อมูล หรือไม่มีใครสามารถให้ได้เลย",
  },
];
export const paymentLevel = [
  {
    value: 5,
    label: "ชำระปกติไม่เคยค้างค่าไฟฟ้า",
  },
  {
    value: 4,
    label: "เคยค้างแต่เคลียร์หมดแล้ว",
  },
  {
    value: 3,
    label: "ยังคงค้างค่าไฟฟ้าอยู่ยอดไม่เยอะและพยามเคลียร์",
  },
  {
    value: 2,
    label: "ค้างค่าไฟฟ้าอยู่มีแนวโน้มว่าจะแก้ปัญหาไม่ได้เร็วๆนี้",
  },
  {
    value: 1,
    label: "ค้างค่าไฟฟ้าอยู่เยอะมาก เคลียร์ยาก ",
  },
];

export const locationLevel = [
  {
    value: 5,
    label: "มีพื้นที่เหมาะสมเพียงพอต่อกำลังการติดตั้ง",
  },
  {
    value: 4,
    label: "มีพื้นที่เพียงพอโดยรวม อาจมีบางส่วนถูกใช้งานแต่สามารถจัดสรรได้",
  },
  {
    value: 3,
    label: "พื้นที่มีจำกัด ต้องวางแผนดี อาจติดตั้งได้บางส่วน",
  },
  {
    value: 2,
    label: "พื้นที่น้อยมาก หรือต้องย้ายอุปกรณ์เดิมถึงจะติดตั้งได้",
  },
  {
    value: 1,
    label: "ไม่มีพื้นที่ที่เหมาะสมในการติดตั้งเลย",
  },
];
export const materialLevel = [
  {
    value: 5,
    label: "หลังคาเมทัลชีท,ซีแพค,กระเบื้องลอนคู่ ใหม่เหมาะสม",
  },
  {
    value: 4,
    label:
      "วัสดุไม่เหมาะสมบางจุด เช่น กระเบื้องแผ่นบาง มีช่องเซอร์วิส ไม่ชันมาก",
  },
  {
    value: 3,
    label: "วัสดุเหมาะสม หลังคาชันไม่มาก ไม่มีช่องเซอร์วิส",
  },
  {
    value: 2,
    label: "วัสดุเหมาะสม แต่หลังคาชันมาก มีหรือไม่มีช่องเซอร์วิส",
  },
  {
    value: 1,
    label: "หลังคาชำรุดหรือเสี่ยงอันตราย ต้องซ่อมแซมเปลี่ยนใหม่",
  },
];
export const structureLevel = [
  {
    value: 5,
    label: "โครงสร้างแข็งแรง ใช้วัสดุที่เหมาะสม เป็นเหล็ก",
  },
  {
    value: 4,
    label: "โครงสร้างเหล็กแต่มีอายุใช้งานนานแล้ว อาจต้องเสริมจุดบางจุด",
  },
  {
    value: 3,
    label: "โครงสร้างไม้ มีอายุใช้งานนานแล้ว อาจต้องเสริมจุดบางจุด",
  },
  {
    value: 2,
    label: "โครงสร้างไม่เหมาะสมบางจุด เช่น แปขนาดเล็ก คานขนาดเล็ก",
  },
  {
    value: 1,
    label: "โครงสร้างชำรุดหรือเสี่ยงอันตราย ต้องซ่อมแซมเปลี่ยนใหม่",
  },
];
export const connectLevel = [
  {
    value: 5,
    label: "แนวทางเดินสายตรง สั้น และใกล้ห้อง MDB พร้อมราง/ท่อสายไฟ",
  },
  {
    value: 4,
    label: "เดินสายได้สะดวก มีระยะพอเหมาะ ไม่มีสิ่งกีดขวาง",
  },
  {
    value: 3,
    label: "เดินสายได้แต่ต้องเจาะผนัง/ปีนหลังคาหลายจุด",
  },
  {
    value: 2,
    label: "แนวสายซับซ้อน ต้องเดินลอดอาคารหรือระยะไกล",
  },
  {
    value: 1,
    label:
      "เดินสายลำบากมาก ไม่มีแนวสายที่เหมาะสม หรือเสี่ยงต้องดัดแปลงโครงสร้าง",
  },
];
export const easyLevel = [
  {
    value: 5,
    label: "รถขนของเข้าถึงจุดติดตั้งได้โดยตรง ไม่มีสิ่งกีดขวาง ใช้เครนวางได้",
  },
  {
    value: 4,
    label: "เข้าถึงได้ค่อนข้างง่าย อาจมีทางลาด/พื้นที่แคบบางช่วง",
  },
  {
    value: 3,
    label: "ต้องขนของต่อด้วยแรงงานหลายจุด หรือขึ้นอาคารหลายชั้น",
  },
  {
    value: 2,
    label: "ต้องใช้รอก/ลิฟต์/เครนในการขนของ เพราะเข้าไม่ถึง",
  },
  {
    value: 1,
    label: "เข้าถึงลำบากมาก มีข้อจำกัดด้านความสูง พื้นที่ หรือความปลอดภัย",
  },
];

const test = [
  {
    ค่าไฟ: 1000,
    CA: "123127382173",
    อัตรา: "1234",
  },
  {
    ค่าไฟ: 2000,
    CA: "21382173",
    อัตรา: "3333",
  },
];
